# Using Data Structures Effectively 

## pandas DataFrames

### DataFrame functionality

In [1]:
import pandas as pd

In [2]:
usa_data = pd.Series(
    [13.33, 14.02, 14.02, 14.25], index=["2000", "2001", "2002", "2003"]
)

In [3]:
usa_data

2000    13.33
2001    14.02
2002    14.02
2003    14.25
dtype: float64

In [4]:
india_data = pd.Series([9.02, 9.01, 8.84, 8.84], index=["2000", "2001", "2002", "2003"])

In [5]:
df = pd.DataFrame({"USA": usa_data, "India": india_data})

In [6]:
df

        USA  India
2000  13.33   9.02
2001  14.02   9.01
2002  14.02   8.84
2003  14.25   8.84

### DataFrame performance

In [7]:
df = pd.read_excel("../data/SG_GEN_PARL.xlsx")
df = df.drop(
    [
        "Goal",
        "Target",
        "Indicator",
        "SeriesCode",
        "SeriesDescription",
        "GeoAreaCode",
        "Reporting Type",
        "Sex",
        "Units",
    ],
    axis=1,
)
df = df.set_index("GeoAreaName").transpose()

In [9]:
df.head()

GeoAreaName,Afghanistan,Albania,Algeria,Andorra,Angola,Antigua and Barbuda,Argentina,Armenia,Australia,Austria,...,United Republic of Tanzania,United States of America,Uruguay,Uzbekistan,Vanuatu,Venezuela (Bolivarian Republic of),Viet Nam,Yemen,Zambia,Zimbabwe
2000,NaN,5.16,3.16,7.14,15.45,5.26,28.02,3.05,22.45,26.78,...,22.18,13.33,12.12,6.8,0.00,12.14,26.00,0.66,10.13,14.00
2001,NaN,5.16,3.42,7.14,15.45,5.26,26.46,3.05,22.97,26.78,...,22.18,14.02,12.12,7.2,0.00,9.70,26.00,0.66,10.13,9.33
2002,NaN,5.71,3.42,14.29,15.45,5.26,30.74,3.05,25.33,26.78,...,22.26,14.02,12.12,7.2,0.00,9.70,26.00,0.67,12.03,10.00
2003,NaN,5.71,6.17,14.29,15.45,5.26,30.74,3.05,25.33,33.88,...,22.26,14.25,12.12,7.2,1.92,9.70,27.31,0.67,12.03,10.00
2004,NaN,5.71,6.17,14.29,15.45,5.26,30.74,4.58,25.33,33.88,...,21.36,14.25,12.12,7.2,1.92,9.70,27.31,0.33,12.03,10.00

In [10]:
%%timeit
df["India_fraction"] = df["India"] / 100

65 Î¼s Â± 1.27 Î¼s per loop (mean Â± std. dev. of 7 runs, 10,000 loops each)

In [11]:
%%timeit
df["India_fraction"] = df["India"].apply(lambda x: x / 100)

68.1 Î¼s Â± 219 ns per loop (mean Â± std. dev. of 7 runs, 10,000 loops each)

In [12]:
%%timeit
df["India_fraction"] = [row["India"] / 100 for index, row in df.iterrows()]

483 Î¼s Â± 8.38 Î¼s per loop (mean Â± std. dev. of 7 runs, 1,000 loops each)